/* 클래스 블록 : 클래스명은 소스파이르이 이름 (클래스명.java)과 동일하게 사용해야 한다.
    명명 규칙 : 클래스명은 명사로 한다.
              여러개의 단어가 섞이는 경우 각 단어의 첫번째 문자는 대문자. (CamelCase)
*/
public class Sample { // 블록의 시작

    /* 변수
        - 변수명은 숫자로 시작할 수 없다.
        - _(underscore)와 $ 이외 특수문자는 사용할 수 없다.
        - 자바의 키워드는 변수명으로 사용할 수 없다.
        명명 규칙 : 변수는 짧지만 의미가 있어야 한다. 변수의 사용 의도를 알 수 있도록.
                  순서를 의미하는 임시적인 정수의 변수명은 i,j,k,m,n 을 사용.
    */

    /* 자료형 (Type)
        int
        long
        double
        boolean
        char
        String
        StringBuffer
        List
        Map

        - 사용자 정의 자료형은 Class 로 생성.
     */

    /* 메소드 블록
        [접근제어자 public|private|protected] [static] (리턴자료형|void) 메소드명 (입력자료형 입력변수,...){
            명령문(statement);
            // 명령문은 반드시 세미콜론(;)을 붙여 문장의 끝을 표시해야 한다.
            ... }
        명명 규칙 : 메소드명은 동사로 한다.
                  클래스명과 마찬가지로 여러개의 단어가 섞이는 경우 각 단어의 첫번째 문자는 대문자.
                  단 처음 시작하는 문자는 항상 소문자로 시작.
     */

} // 블록의 끝끝
